app/Models/Admin_Model.php

    public function ambil_berkas()
    {
        return $this->db->table('berkas')->join('user', 'user.id_user = berkas.id_user')->get()->getResult();
---
SELECT *
FROM `berkas`
JOIN `user` ON `user`.`id_user` = `berkas`.`id_user`