app/Models/Login_Model.php

SELECT *
FROM `user`
WHERE `email` = 'hidayatnurwahid969@gmail.com'
---
    public function find_email($email){
        return $this->db->table('user')->where($email)->get();