app/Models/User_Model.php

    public function berkas_check($data){
        return $this->db->table('berkas')->getWhere($data)->getResult();
---
SELECT *
FROM `berkas`
WHERE 3 IS NULL

    public function submit_id($data,$id){
        return $this->db->table('user')->update($data,$id);
---
UPDATE `user` SET `nama_lengkap` = 'Hidayat Nurwahid', `nohp` = '08959613', `email` = 'hidayatnurwahid969@gmail.com'
WHERE `id_user` = '6'

    public function submit_berkas($data,$id){
        return $this->db->table('berkas')->update($data,$id);
---
UPDATE `berkas` SET `ktp_suami` = 'Berkas/ktp_suami/1677141807_ee8d1dde9c11a1ff4058.png'
WHERE `id_user` = '3'

    public function add_field_berkas($data){
        return $this->db->table('berkas')->insert($data);
---
INSERT INTO `berkas` (`id_user`) VALUES ('6')